# Cheatsheet Company Database

-   **Visualização do Schema:**
    -   [Abrir imagem](img/company-database.png)
-   **Tutorial Youtube:**
    -   [Mike Dane - SQL Course](https://www.mikedane.com/databases/sql/company-database-intro/)
    -   [SQL Tutorial - Full Database Course for Beginners](https://www.youtube.com/watch?v=HXV3zeQKqGY&t=10850s&ab_channel=freeCodeCamp.org)
-   **Firewall Settings do SQL Database:**
    -   Start IP: 0.0.0.1
    -   End IP: 239.255.255.255
___

# Tópico 1: Tabelas e Registros

## Criar Tabelas e inserir registros

In [ ]:
-- CREATE TABLES
CREATE TABLE employee
(
    emp_id INT PRIMARY KEY,
    first_name VARCHAR(40),
    last_name VARCHAR(40),
    birth_day DATE,
    sex VARCHAR(1),
    salary INT,
    super_id INT,
    branch_id INT
);

CREATE TABLE branch
(
    branch_id INT PRIMARY KEY,
    branch_name VARCHAR(40),
    mgr_id INT,
    mgr_start_date DATE,
    FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL
);

ALTER TABLE employee
ADD FOREIGN KEY(branch_id)
REFERENCES branch(branch_id)
ON DELETE SET NULL;

ALTER TABLE employee
ADD FOREIGN KEY(super_id)
REFERENCES employee(emp_id)
ON DELETE NO ACTION;

CREATE TABLE client
(
    client_id INT PRIMARY KEY,
    client_name VARCHAR(40),
    branch_id INT,
    FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL
);

CREATE TABLE works_with
(
    emp_id INT,
    client_id INT,
    total_sales INT,
    PRIMARY KEY(emp_id, client_id),
    FOREIGN KEY(emp_id) REFERENCES employee(emp_id) ON DELETE CASCADE,
    FOREIGN KEY(client_id) REFERENCES client(client_id) ON DELETE CASCADE
);

CREATE TABLE branch_supplier
(
    branch_id INT,
    supplier_name VARCHAR(40),
    supply_type VARCHAR(40),
    PRIMARY KEY(branch_id, supplier_name),
    FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE CASCADE
);

In [ ]:
-- INSERT INTO


-- Corporate
INSERT INTO employee VALUES(100, 'David', 'Wallace', '1967-11-17', 'M', 250000, NULL, NULL);

INSERT INTO branch VALUES(1, 'Corporate', 100, '2006-02-09');

UPDATE employee
SET branch_id = 1
WHERE emp_id = 100;

INSERT INTO employee VALUES(101, 'Jan', 'Levinson', '1961-05-11', 'F', 110000, 100, 1);

-- Scranton
INSERT INTO employee VALUES(102, 'Michael', 'Scott', '1964-03-15', 'M', 75000, 100, NULL);

INSERT INTO branch VALUES(2, 'Scranton', 102, '1992-04-06');

UPDATE employee
SET branch_id = 2
WHERE emp_id = 102;

INSERT INTO employee VALUES(103, 'Angela', 'Martin', '1971-06-25', 'F', 63000, 102, 2);
INSERT INTO employee VALUES(104, 'Kelly', 'Kapoor', '1980-02-05', 'F', 55000, 102, 2);
INSERT INTO employee VALUES(105, 'Stanley', 'Hudson', '1958-02-19', 'M', 69000, 102, 2);

-- Stamford
INSERT INTO employee VALUES(106, 'Josh', 'Porter', '1969-09-05', 'M', 78000, 100, NULL);

INSERT INTO branch VALUES(3, 'Stamford', 106, '1998-02-13');

UPDATE employee
SET branch_id = 3
WHERE emp_id = 106;

INSERT INTO employee VALUES(107, 'Andy', 'Bernard', '1973-07-22', 'M', 65000, 106, 3);
INSERT INTO employee VALUES(108, 'Jim', 'Halpert', '1978-10-01', 'M', 71000, 106, 3);


-- BRANCH SUPPLIER
INSERT INTO branch_supplier VALUES(2, 'Hammer Mill', 'Paper');
INSERT INTO branch_supplier VALUES(2, 'Uni-ball', 'Writing Utensils');
INSERT INTO branch_supplier VALUES(3, 'Patriot Paper', 'Paper');
INSERT INTO branch_supplier VALUES(2, 'J.T. Forms & Labels', 'Custom Forms');
INSERT INTO branch_supplier VALUES(3, 'Uni-ball', 'Writing Utensils');
INSERT INTO branch_supplier VALUES(3, 'Hammer Mill', 'Paper');
INSERT INTO branch_supplier VALUES(3, 'Stamford Lables', 'Custom Forms');

-- CLIENT
INSERT INTO client VALUES(400, 'Dunmore Highschool', 2);
INSERT INTO client VALUES(401, 'Lackawana Country', 2);
INSERT INTO client VALUES(402, 'FedEx', 3);
INSERT INTO client VALUES(403, 'John Daly Law, LLC', 3);
INSERT INTO client VALUES(404, 'Scranton Whitepages', 2);
INSERT INTO client VALUES(405, 'Times Newspaper', 3);
INSERT INTO client VALUES(406, 'FedEx', 2);

-- WORKS_WITH
INSERT INTO works_with VALUES(105, 400, 55000);
INSERT INTO works_with VALUES(102, 401, 267000);
INSERT INTO works_with VALUES(108, 402, 22500);
INSERT INTO works_with VALUES(107, 403, 5000);
INSERT INTO works_with VALUES(108, 403, 12000);
INSERT INTO works_with VALUES(105, 404, 33000);
INSERT INTO works_with VALUES(107, 405, 26000);
INSERT INTO works_with VALUES(102, 406, 15000);
INSERT INTO works_with VALUES(105, 406, 130000);

___
## Consultar e deletar tabelas e registros

In [ ]:
SELECT * FROM INFORMATION_SCHEMA.TABLES                         -- Consultar tabelas da database
SELECT * FROM INFORMATION_SCHEMA.CONSTRAINT_COLUMN_USAGE        -- Consultar Constraint de cada coluna

DROP TABLE works_with;                                          -- Deletar a tabela
DELETE TABLE works_with;                                        -- Deletar todos os registros da tabela (Ppode ser desfeito e pode usar WHERE)
TRUNCATE TABLE works_with;                                      -- Deletar todos os registros da tabela (Não pode ser desfeito e não pode usar WHERE)

# Tópico 2: Usuários e Permissões

## Criar, deletar e consultar Login  
O Login deve ser criado no DB \_master

In [ ]:
SELECT * FROM master.sys.sql_logins                             -- Consultar logins do SQL Server (Precisa estar na database Master)
CREATE LOGIN Lestark WITH PASSWORD = 'Lest@rk123';              -- Criar login no SQL Server (Precisa estar na database Master)
DROP LOGIN Lestark;                                             -- Consultar logins do SQL Server (Precisa estar na database Master)

___
## Criar, deletar e consultar Users
Executar CREATE USER na DataBase que deseja-se conceder privilégio CONNECT para o usuário

In [ ]:
CREATE USER Lestark FOR LOGIN Lestark;                          -- Criar usuário na DB atual para login previamente criado no DB Mater
CREATE USER [email@prov.com.br] FROM EXTERNAL PROVIDER;         -- Criar Usuário na DB atual para login externo (AD Azure por exemplo)
SELECT * FROM Company.sys.sysusers                              -- Consultar usuários criados na DB atual
DROP USER Lestark;                                              -- Remover usuário na DB atual

___
## Conceder, revogar e consultar privilégios
Executar GRANT na DataBase que deseja-se conceder os privilégios. - [Tutorial Grant/Revoke](https://www.techonthenet.com/sql_server/grant_revoke.php)

In [ ]:
GRANT SELECT TO [luciano.oliveira@belgobekaert.com.br];         -- Conceder privilégios de SELECT para usuário
REVOKE SELECT FROM [luciano.oliveira@belgobekaert.com.br];      -- Revogar privilégios de SELECT do usuário

GRANT SELECT, CREATE TABLE, INSERT TO Lestark;                  -- Conceder vários privilégios simultaneamente à um usuário
REVOKE CREATE TABLE, INSERT FROM Lestark;                       -- Revogar vários privilégios simultaneamente à um usuário


SELECT                                                          -- Consultar privilégios de usuário no DataBase:
    USER_NAME(grantee_principal_id) [User]
  , permission_name
  , state_desc
FROM sys.database_permissions
WHERE USER_NAME(grantee_principal_id) = 'Lestark'

___

# Tópico 3: Query SELECT

Clausula **WHERE**

In [ ]:
-- Operadores AND, OR, NOT
SELECT * FROM Employee
WHERE (sex = 'M') and (birth_day > '1970-01-01');

-- Operador BETWEEN
SELECT * FROM Employee
WHERE birth_day BETWEEN '1970-01-01' AND '1980-01-01'

-- IN
SELECT * FROM Employee
WHERE first_name IN ('Kelly', 'Josh');

SELECT * FROM Employee
WHERE (super_id IS NOT NULL) AND ( (sex = 'M') OR (salary >= '70000') );  -- cond1 AND (cond2 OR cond2)

SELECT * FROM Employee
WHERE ( (super_id IS NOT NULL) AND (sex = 'M') ) OR (salary >= '70000');  -- (cond1 AND cond2) OR cond3

-- TOP rows e ORDER BY
SELECT TOP 5 * FROM Employee
ORDER BY sex, salary DESC;

Clausula **GROUP BY** e Funções **COUNT()**, **AVG(),**, **SUM()**, **MIN()**, **MAX()**

In [ ]:
-- Calcular funções agregadoras
SELECT AVG(salary) AS Média, COUNT(salary) AS Cont, SUM(salary) AS Soma, MIN(salary) AS Mi, MAX(salary) AS Ma FROM employee;

-- Somar salário para cada combinação de 'branch_id' e 'Sex'
SELECT branch_id, Sex, SUM(salary) AS 'Soma_salário' FROM employee
GROUP BY Sex, branch_id
ORDER BY 'Soma_Salário' DESC;

-- GROUP BY apenas de registros nascidos a partir de 1970, mostrando somente 'brand_id' = 1 e 'Sex' = 1
SELECT branch_id, Sex, SUM(salary) AS 'Soma_salário' FROM employee
WHERE birth_day > '1970-01-01'          -- WHERE filtra a tabela que será usada no GROUP BY
GROUP BY Sex, branch_id
HAVING branch_id <> '1' AND Sex = 'F'   -- HAVING filtra a tabela gerada pela GROUP BY
ORDER BY Sex ASC;

Clausula **JOIN**

In [ ]:
-- Em qual branch atua cada employee?
SELECT employee.emp_id, employee.first_name, branch.branch_name
FROM employee
INNER JOIN branch ON employee.branch_id=branch.branch_id;

-- Quais employees atendem o cliente FedEx?
SELECT employee.emp_id, employee.first_name, client.client_name
FROM employee
INNER JOIN client ON employee.branch_id=client.branch_id
WHERE client_name = 'FedEx'

-- Total sales por employee name
SELECT employee.first_name, SUM(works_with.total_sales) AS SumTotSales
FROM employee
INNER JOIN works_with ON employee.emp_id=works_with.emp_id
GROUP BY first_name

-- Total sales por employee name
SELECT employee.first_name, SUM(works_with.total_sales) AS SumTotSales
FROM employee
LEFT JOIN works_with ON employee.emp_id=works_with.emp_id
GROUP BY first_name

In [ ]:
-- Cada cliente recebe qual supply_tipe?